Revit 2027 API
MacroManager.GetBasicIEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
internal virtual IEnumerator GetBasicIEnumerator()
Friend Overridable Function GetBasicIEnumerator As IEnumerator
internal:
virtual IEnumerator^ GetBasicIEnumerator()
internal abstract GetBasicIEnumerator : unit -> IEnumerator
internal override GetBasicIEnumerator : unit -> IEnumerator
Return Value
IEnumerator
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable.GetEnumerator()
See Also
Reference
MacroManager Class
Autodesk.Revit.DB.Macros Namespace